In [1]:
people = {
    'first': ['Corey', 'Jhon', 'Jane'],
    'last': ['Schafer', 'Doe', 'Dow'],
    'email': ['CoreyMSchafer@gmail.com', 'JhonDoe@example.com', 'JaneDow@example.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jhon      Doe      JhonDoe@example.com
2   Jane      Dow      JaneDow@example.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns = ['first name', 'last name', 'email']

In [7]:
df.columns

Index(['first name', 'last name', 'email'], dtype='object')

In [8]:
df

  first name last name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jhon       Doe      JhonDoe@example.com
2       Jane       Dow      JaneDow@example.com

In [9]:
df.columns = [x.upper() for x in df.columns]

In [10]:
df

  FIRST NAME LAST NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jhon       Doe      JhonDoe@example.com
2       Jane       Dow      JaneDow@example.com

In [11]:
df.columns = df.columns.str.replace(' ', '_')

In [12]:
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jhon       Doe      JhonDoe@example.com
2       Jane       Dow      JaneDow@example.com

In [13]:
df.rename(columns={'FIRST_NAME':'first', 'LAST_NAME':'last'}, inplace=True)

In [14]:
df

   first     last                    EMAIL
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jhon      Doe      JhonDoe@example.com
2   Jane      Dow      JaneDow@example.com

In [15]:
df.columns = [x.lower() for x in df.columns]

In [16]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jhon      Doe      JhonDoe@example.com
2   Jane      Dow      JaneDow@example.com

In [17]:
df.loc[1]

first                   Jhon
last                     Doe
email    JhonDoe@example.com
Name: 1, dtype: object

In [18]:
df.loc[1]['last'] = 'Smith'

In [19]:
df.loc[1]

first                   Jhon
last                   Smith
email    JhonDoe@example.com
Name: 1, dtype: object

In [20]:
df.loc[1, 'last'] = 'Doe'

In [21]:
df.loc[1]

first                   Jhon
last                     Doe
email    JhonDoe@example.com
Name: 1, dtype: object

In [22]:
df.loc[1, ['last', 'email']] = ['Smith', 'JhonSmith@example.com']

In [23]:
 df.loc[1]

first                     Jhon
last                     Smith
email    JhonSmith@example.com
Name: 1, dtype: object

In [24]:
filtre = (df['email'] == 'JhonSmith@example.com')
df[filtre]

  first   last                  email
1  Jhon  Smith  JhonSmith@example.com

In [25]:
df.loc[filtre]

  first   last                  email
1  Jhon  Smith  JhonSmith@example.com

In [26]:
df.loc[filtre, 'last'] = 'Smithson'

In [27]:
df

   first      last                    email
0  Corey   Schafer  CoreyMSchafer@gmail.com
1   Jhon  Smithson    JhonSmith@example.com
2   Jane       Dow      JaneDow@example.com

In [28]:
df['email'].apply(len)

0    23
1    21
2    19
Name: email, dtype: int64

In [29]:
def update_email(email):
    return email.upper()

In [30]:
df['email'].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1      JHONSMITH@EXAMPLE.COM
2        JANEDOW@EXAMPLE.COM
Name: email, dtype: object

In [31]:
df

   first      last                    email
0  Corey   Schafer  CoreyMSchafer@gmail.com
1   Jhon  Smithson    JhonSmith@example.com
2   Jane       Dow      JaneDow@example.com

In [32]:
df['email'].apply(lambda x: x.lower())

0    coreymschafer@gmail.com
1      jhonsmith@example.com
2        janedow@example.com
Name: email, dtype: object

In [33]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [34]:
df.apply(pd.Series.min)

first                      Corey
last                         Dow
email    CoreyMSchafer@gmail.com
dtype: object

In [35]:
df.apply(lambda x: x.min())

first                      Corey
last                         Dow
email    CoreyMSchafer@gmail.com
dtype: object

In [36]:
df.applymap(len)

   first  last  email
0      5     7     23
1      4     8     21
2      4     3     19

In [37]:
df.applymap(str.lower)

   first      last                    email
0  corey   schafer  coreymschafer@gmail.com
1   jhon  smithson    jhonsmith@example.com
2   jane       dow      janedow@example.com

In [38]:
df['first'].map({'Corey':'Chris', 'Jane':'Mary'})

0    Chris
1      NaN
2     Mary
Name: first, dtype: object

In [39]:
df['first'] = df['first'].replace({'Corey':'Chris', 'Jane':'Mary'})

In [40]:
df

   first      last                    email
0  Chris   Schafer  CoreyMSchafer@gmail.com
1   Jhon  Smithson    JhonSmith@example.com
2   Mary       Dow      JaneDow@example.com